def compare(mas1, mas2):
    if mas1[0] > mas2[0]:
        return 2
    if mas1[0] < mas2[0]:
        return 1
    if mas1[0] == mas2[0]:
        k = mas1[0]
        for i in range(k):
            if mas1[1][i] > mas2[1][i]:
                return 2
            if mas1[1][i] < mas2[1][i]:
                return 1

        return 0


def summa(mas1, mas2):
    """
    на вход даны два числа в виде массива: ячейка 0 - число разрядов
    в ячейке 1 - массив num, ячейки массива num- цифры числа начиная со старшего разряда
    то есть mas1[n, num[n]]
    Пример:
    mas1 = [5, [1, 1, 1, 1, 1]]
    mas2 = [4, [1, 1, 1, 1]]
    сравниваем кол-во разрядов в числах, какое число больше нам все равно
    и по разрядно складываем два числа
    """
    if mas1[0] == mas2[0]:                      #если кол-во разрядов одинаковое, то на всякий случай
        s = [mas1[0], [0] * (mas1[0] + 1)]                #cоздаем массив на 1 эл-нт больше максимального
        for i in range(-1, -(mas1[0] + 1), -1):
            s[1][i] = mas1[1][i] + mas2[1][i]
            n = mas1[0]
    elif compare(mas1, mas2) == 2:
        s = [mas1[0], [0] * (mas2[0] + 1)]
        s[1][0] = mas1[1][0]
        for i in range(-1, -(mas2[0] + 1), -1):
            s[1][i] = mas1[1][i]+mas2[1][i]
            n = mas2[0]
    elif compare(mas1, mas2) == 1:
        s = [mas2[0], [0] * (mas1[0] + 1)]
        s[1][0] = mas2[1][0]
        for i in range(-1, -(mas1[0] + 1), -1):
            s[i] = mas1[1][i] + mas2[1][i]
            n = mas1[0]

    for j in range(-1, -(n + 1), -1):           #проверяем если эл-ты массива >10 и приводим число
        if s[1][j] >= 10:                          #к нормальному виду
            s[1][j] = s[1][j] - 10
            s[1][j - 1] = s[1][j - 1] + 1

    if s[1][0] == 0:                               #если лишний разряд не понадобился, то перезаписываем
        d = [mas1[0], [0] * (mas1[0])]                      #все в новый массив
        for i in range(mas1[0]):
            d[1][i] = s[1][i+1]
        s = d

    return s
"думаю можно было бы написать лучше, но как есть D:"